pd_disagg/results/b1_matrix/raw/20260821T1933_tp2_2048x128_sweep_rps3.8_bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72c6873df560>, trust_remote_code=False, seed=2004, num_prompts=192, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='localhost', port=8100, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen2-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=3.8, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='results/b1_matrix/raw', result_filename='20260821T1933_tp2_2048x128_sweep_rps3.8_bench.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-89fba62a-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-21 19:33:52 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 3.8
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 192/192 [00:53<00:00,  3.60it/s]
Failed requests during benchmark run detected (capping to 10):
Error 0: Traceback (most recent call last):
  File "/root/venvs/v0.25.1/lib/python3.12/site-packages/vllm/benchmarks/lib/endpoint_request_func.py", line 201, in async_request_openai_completions
    async with session.post(url=api_url, json=payload, headers=headers) as response:
               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/root/venvs/v0.25.1/lib/python3.12/site-packages/aiohttp/client.py", line 1693, in __aenter__
    self._resp: _RetType_co = await self._coro
                              ^^^^^^^^^^^^^^^^
  File "/root/venvs/v0.25.1/lib/python3.12/site-packages/aiohttp/client.py", line 858, in _request
    resp = await handler(req)
           ^^^^^^^^^^^^^^^^^^
  File "/root/venvs/v0.25.1/lib/python3.12/site-packages/aiohttp/client.py", line 836, in _connect_and_send_request
    await resp.start(conn)
  File "/root/venvs/v0.25.1/lib/python3.12/site-packages/aiohttp/client_reqrep.py", line 558, in start
    message, payload = await protocol.read()  # type: ignore[union-attr]
                       ^^^^^^^^^^^^^^^^^^^^^
  File "/root/venvs/v0.25.1/lib/python3.12/site-packages/aiohttp/streams.py", line 705, in read
    await self._waiter
aiohttp.client_exceptions.ServerDisconnectedError: Server disconnected

tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     191       
Failed requests:                         1         
Request rate configured (RPS):           3.80      
Benchmark duration (s):                  53.32     
Total input tokens:                      391168    
Total generated tokens:                  24448     
Request throughput (req/s):              3.58      
Output token throughput (tok/s):         458.53    
Peak output token throughput (tok/s):    2687.00   
Peak concurrent requests:                62.00     
Total token throughput (tok/s):          7795.01   
---------------Time to First Token----------------
Mean TTFT (ms):                          716.57    
Median TTFT (ms):                        709.64    
P50 TTFT (ms):                           709.64    
P90 TTFT (ms):                           1141.83   
P99 TTFT (ms):                           1794.46   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          59.83     
Median TPOT (ms):                        65.18     
P50 TPOT (ms):                           65.18     
P90 TPOT (ms):                           95.01     
P99 TPOT (ms):                           101.48    
---------------Inter-token Latency----------------
Mean ITL (ms):                           59.83     
Median ITL (ms):                         17.09     
P50 ITL (ms):                            17.09     
P90 ITL (ms):                            205.38    
P99 ITL (ms):                            220.22    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8315.27   
Median E2EL (ms):                        8991.29   
P50 E2EL (ms):                           8991.29   
P90 E2EL (ms):                           12775.49  
P99 E2EL (ms):                           13279.52  
==================================================