pd_disagg/results/b1_matrix/raw/20260821T1944_tp2_8192x128_sweep_rps0.95_bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7406fb43b060>, trust_remote_code=False, seed=3004, num_prompts=56, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=8192, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='localhost', port=8100, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen2-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=0.95, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='results/b1_matrix/raw', result_filename='20260821T1944_tp2_8192x128_sweep_rps0.95_bench.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-19458b83-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-21 19:44:39 [utils.py:90] Sampling input_len from [8192, 8192] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 0.95
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 56/56 [01:01<00:00,  1.10s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     56        
Failed requests:                         0         
Request rate configured (RPS):           0.95      
Benchmark duration (s):                  61.59     
Total input tokens:                      458752    
Total generated tokens:                  7168      
Request throughput (req/s):              0.91      
Output token throughput (tok/s):         116.39    
Peak output token throughput (tok/s):    598.00    
Peak concurrent requests:                18.00     
Total token throughput (tok/s):          7565.32   
---------------Time to First Token----------------
Mean TTFT (ms):                          1657.44   
Median TTFT (ms):                        1547.49   
P50 TTFT (ms):                           1547.49   
P90 TTFT (ms):                           2530.52   
P99 TTFT (ms):                           3200.43   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          53.70     
Median TPOT (ms):                        48.04     
P50 TPOT (ms):                           48.04     
P90 TPOT (ms):                           97.34     
P99 TPOT (ms):                           114.15    
---------------Inter-token Latency----------------
Mean ITL (ms):                           53.70     
Median ITL (ms):                         12.05     
P50 ITL (ms):                            12.05     
P90 ITL (ms):                            216.32    
P99 ITL (ms):                            229.63    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8476.81   
Median E2EL (ms):                        8037.29   
P50 E2EL (ms):                           8037.29   
P90 E2EL (ms):                           13704.52  
P99 E2EL (ms):                           16480.10  
==================================================